Tekla.Structures.Drawing.GenericAttributesBase
The GenericAttributesBase class is a base class that shared attributes among many classes use.

Tekla.Structures.Drawing.GenericAttributesBase.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.